Revit 2027 API
BuiltInFailures.GenericMEPFailures.ValidatePHSegmentConnWarning Property
 The placeholder curve will not be able to connect to the required fittings for placeholder convert
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ValidatePHSegmentConnWarning { get; }
Public Shared ReadOnly Property ValidatePHSegmentConnWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ValidatePHSegmentConnWarning {
	FailureDefinitionId^ get ();
}
static member ValidatePHSegmentConnWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace